# Parameters
nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 6, MobileOne, [128, 4, 1, False]], #2
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, MobileOne, [256, 4, 1, False]], #4
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 6, MobileOne, [512, 4, 1, False]], #6
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 6, MobileOne, [1024, 4, 1, False]], #8
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

head:
  [[-1, 1, GSConv, [512, 1, 1]], #10
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #11
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4 #12
   [-1, 3, C3_Faster, [512, False]],  # 13
   [-1, 1, SimAM, [1e-4]],  # 14

   [-1, 1, GSConv, [256, 1, 1]], #15
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #16
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3 17
   [-1, 3, C3_Faster, [256, False]],  # 18 (P3/8-small)
   [-1, 1, SimAM, [1e-4]],  # 19

   [-1, 1, GSConv, [256, 3, 2]], #20
   [[-1, 14], 1, Concat, [1]],  # cat head P4 #21
   [-1, 3, C3_Faster, [512, False]],  # 22 (P4/16-medium)
   [-1, 1, SimAM, [1e-4]],  # 23

   [-1, 1, GSConv, [512, 3, 2]], # 24
   [[-1, 10], 1, Concat, [1]],  # cat head P5 25
   [-1, 3, C3_Faster, [1024, False]],  # 26 (P5/32-large)
   [-1, 1, SimAM, [1e-4]],  # 27

   [[18, 22, 26], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]